# Data Handling Using Pandas

In [10]:
import pandas as pd

In [11]:
df=pd.read_excel("students.xlsx")

In [12]:
print("Students record as follows:")

Students record as follows:

In [13]:
df

    Name  Age  Marks
0   John   20     85
1  Alice   22     90
2    Bob   21     78
3   Sara   23     92
4    Sam   25     90